Weistr/mcu32_temple/Markbase_GD32F303CBT6/原板资料/4_例程/实验12 USB虚拟串口实验/Middlewares/USB/CONFIG/usbd_conf.c
/************************************************ 
* WKS Mini GD32开发板
* usbd_conf 驱动代码	   
* 版本：V1.0								  
************************************************/	   

#include "gd32f30x.h"
#include "usbd_def.h"
#include "usbd_core.h"
#include "usbd_cdc.h"
#include "hw_config.h"
#include "stm32f1xx_hal_pcd.h"

PCD_HandleTypeDef hpcd_USB_FS;
void Error_Handler(void);

static USBD_StatusTypeDef USBD_Get_USB_Status(HAL_StatusTypeDef hal_status);

void HAL_PCDEx_SetConnectionState(PCD_HandleTypeDef *hpcd, uint8_t state);

/* MSP Init */
//初始化PCD MSP
//pcdHandle:PCD结构体指针
void HAL_PCD_MspInit(PCD_HandleTypeDef* pcdHandle)
{
		if(pcdHandle->Instance==USB)
		{
			rcu_periph_clock_enable(RCU_GPIOA);           //GPIOA时钟使能
			rcu_usb_clock_config(RCU_CKUSB_CKPLL_DIV2_5); //USB时钟为48M,系统时钟2.5分频
			rcu_periph_clock_enable(RCU_USBD);            //使能USBD时钟
			
			//PA11,12复用推挽输出
			gpio_init(GPIOA, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_11 | GPIO_PIN_12);
			//USB中断NVIC配置
			nvic_irq_enable(USBD_LP_CAN0_RX0_IRQn, 0, 3); //抢占优先级0，子优先级3
		}
}

/* MSP Init */
//DeInit PCD MSP，注销PCD MSP
//pcdHandle:PCD结构体指针
void HAL_PCD_MspDeInit(PCD_HandleTypeDef* pcdHandle)
{
		if(pcdHandle->Instance==USB)
		{
			rcu_periph_clock_disable(RCU_USBD);            //失能USBD时钟
			 
			nvic_irq_disable(USBD_LP_CAN0_RX0_IRQn);       //失能中断
		}
}

//USBD和CAN0接收中断服务函数
void USBD_LP_CAN0_RX0_IRQHandler(void)
{
    HAL_PCD_IRQHandler(&hpcd_USB_FS);
}

/*******************************************************************************
                       LL Driver Callbacks (PCD -> USB Device Library)
                       USBD LL PCD驱动回调函数(PCD->USB Device Library)
*******************************************************************************/

//USBD配置阶段回调函数
//hpcd:PCD结构体指针
//返回值:无
void HAL_PCD_SetupStageCallback(PCD_HandleTypeDef *hpcd)
{
		USBD_LL_SetupStage((USBD_HandleTypeDef*)hpcd->pData, (uint8_t *)hpcd->Setup);
}

//USBD OUT阶段回调函数
//hpcd:PCD结构体指针
//返回值:无
void HAL_PCD_DataOutStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
		USBD_LL_DataOutStage((USBD_HandleTypeDef*)hpcd->pData, epnum, hpcd->OUT_ep[epnum].xfer_buff);
}

//USBD IN阶段回调函数
//hpcd:PCD结构体指针
//返回值:无
void HAL_PCD_DataInStageCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
		USBD_LL_DataInStage((USBD_HandleTypeDef*)hpcd->pData, epnum, hpcd->IN_ep[epnum].xfer_buff);
}

//USBD SOF回调函数
//hpcd:PCD结构体指针
//返回值:无
void HAL_PCD_SOFCallback(PCD_HandleTypeDef *hpcd)
{
		USBD_LL_SOF((USBD_HandleTypeDef*)hpcd->pData);
}

//USBD 复位回调函数
//hpcd:PCD结构体指针
//返回值:无
void HAL_PCD_ResetCallback(PCD_HandleTypeDef *hpcd)
{ 
		USBD_SpeedTypeDef speed = USBD_SPEED_FULL;

		if ( hpcd->Init.speed != PCD_SPEED_FULL)
		{
			Error_Handler();
		}
			/* Set Speed. */
		USBD_LL_SetSpeed((USBD_HandleTypeDef*)hpcd->pData, speed);

		/* Reset Device. */
		USBD_LL_Reset((USBD_HandleTypeDef*)hpcd->pData);
}

//USBD 挂起回调函数
//hpcd:PCD结构体指针
//返回值:无
void HAL_PCD_SuspendCallback(PCD_HandleTypeDef *hpcd)//suspend回调
{
		/* Inform USB library that core enters in suspend Mode. */
		USBD_LL_Suspend((USBD_HandleTypeDef*)hpcd->pData);
		/* Enter in STOP mode. */
		/* USER CODE BEGIN 2 */
		if (hpcd->Init.low_power_enable)
		{
			/* Set SLEEPDEEP bit and SleepOnExit of Cortex System Control Register. */
			SCB->SCR |= (uint32_t)((uint32_t)(SCB_SCR_SLEEPDEEP_Msk | SCB_SCR_SLEEPONEXIT_Msk));
		}
		//
		Enter_LowPowerMode();
		/* USER CODE END 2 */
}

//USBD 恢复回调函数
//hpcd:PCD结构体指针
//返回值:无
void HAL_PCD_ResumeCallback(PCD_HandleTypeDef *hpcd)
{
		USBD_LL_Resume((USBD_HandleTypeDef*)hpcd->pData);
}

//USBD ISO OUT事务完成回调函数
//hpcd:PCD结构体指针
//epnum:端点号
//返回值:无
void HAL_PCD_ISOOUTIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
		USBD_LL_IsoOUTIncomplete((USBD_HandleTypeDef*)hpcd->pData, epnum);
}

//USBD ISO IN事务完成回调函数
//hpcd:PCD结构体指针
//epnum:端点号
//返回值:无
void HAL_PCD_ISOINIncompleteCallback(PCD_HandleTypeDef *hpcd, uint8_t epnum)
{
		USBD_LL_IsoINIncomplete((USBD_HandleTypeDef*)hpcd->pData, epnum);
}

//USBD 连接成功回调函数
//hpcd:PCD结构体指针
//返回值:无
void HAL_PCD_ConnectCallback(PCD_HandleTypeDef *hpcd)
{
		USBD_LL_DevConnected((USBD_HandleTypeDef*)hpcd->pData);
}

//USBD 断开连接回调函数
//hpcd:PCD结构体指针
//返回值:无
void HAL_PCD_DisconnectCallback(PCD_HandleTypeDef *hpcd)
{
		USBD_LL_DevDisconnected((USBD_HandleTypeDef*)hpcd->pData);
}

/*******************************************************************************
                       LL Driver Interface (USB Device Library --> PCD)
                       USBD LL 驱动接口函数(USB Device Library --> PCD)
*******************************************************************************/

//USBD底层初始化函数
//pdev:USBD句柄指针
//返回值:0,正常
//       1,忙
//       2,失败
USBD_StatusTypeDef USBD_LL_Init(USBD_HandleTypeDef *pdev)
{
		/* Init USB Ip. */
		/* Link the driver to the stack. */
		//初始化USB IP，并将驱动连接到协议栈
		hpcd_USB_FS.pData = pdev;
		pdev->pData = &hpcd_USB_FS;

		hpcd_USB_FS.Instance = USB;//使用USB实例
		hpcd_USB_FS.Init.dev_endpoints = 8;//端点数为8
		hpcd_USB_FS.Init.speed = PCD_SPEED_FULL;//USB全速模式
		hpcd_USB_FS.Init.low_power_enable = DISABLE;//不使用低功耗模式
		hpcd_USB_FS.Init.lpm_enable = DISABLE;
		hpcd_USB_FS.Init.battery_charging_enable = DISABLE;//不使用电池充电模式
		if (HAL_PCD_Init(&hpcd_USB_FS) != HAL_OK)//PCD Init
		{
			Error_Handler( );
		}
		//端点配置
		/* USER CODE BEGIN EndPoint_Configuration */
		HAL_PCDEx_PMAConfig((PCD_HandleTypeDef*)pdev->pData , 0x00 , PCD_SNG_BUF, 0x18);
		HAL_PCDEx_PMAConfig((PCD_HandleTypeDef*)pdev->pData , 0x80 , PCD_SNG_BUF, 0x58);
		/* USER CODE END EndPoint_Configuration */
		/* USER CODE BEGIN EndPoint_Configuration_CDC */
		HAL_PCDEx_PMAConfig((PCD_HandleTypeDef*)pdev->pData , 0x81 , PCD_SNG_BUF, 0xC0);
		HAL_PCDEx_PMAConfig((PCD_HandleTypeDef*)pdev->pData , 0x01 , PCD_SNG_BUF, 0x110);
		HAL_PCDEx_PMAConfig((PCD_HandleTypeDef*)pdev->pData , 0x82 , PCD_SNG_BUF, 0x100);
		/* USER CODE END EndPoint_Configuration_CDC */
		return USBD_OK;
}

/**
  * @brief  De-Initializes the low level portion of the device driver.
  * @param  pdev: Device handle
  * @retval USBD status
  */
USBD_StatusTypeDef USBD_LL_DeInit(USBD_HandleTypeDef *pdev)
{
		HAL_StatusTypeDef hal_status = HAL_OK;
		USBD_StatusTypeDef usb_status = USBD_OK;

		hal_status = HAL_PCD_DeInit(pdev->pData);

		usb_status =  USBD_Get_USB_Status(hal_status);
	 
		return usb_status; 
}

//USBD底层驱动开始工作
//pdev:USBD句柄指针
//返回值:0,正常
//       1,忙
//       2,失败
USBD_StatusTypeDef USBD_LL_Start(USBD_HandleTypeDef *pdev)
{
		HAL_StatusTypeDef hal_status = HAL_OK;
		USBD_StatusTypeDef usb_status = USBD_OK;
	 
		hal_status = HAL_PCD_Start(pdev->pData);
			 
		usb_status =  USBD_Get_USB_Status(hal_status);
		
		return usb_status;
}

//USBD底层驱动停止工作
//pdev:USBD句柄指针
//返回值:0,正常
//       1,忙
//       2,失败
USBD_StatusTypeDef USBD_LL_Stop(USBD_HandleTypeDef *pdev)
{
		HAL_StatusTypeDef hal_status = HAL_OK;
		USBD_StatusTypeDef usb_status = USBD_OK;

		hal_status = HAL_PCD_Stop(pdev->pData);

		usb_status =  USBD_Get_USB_Status(hal_status);
		
		return usb_status;
}

//USBD初始化(打开)某个端点
//pdev:USBD句柄指针
//ep_addr:端点号
//ep_mps:端点最大包容量(字节)
//返回值:0,正常
//       1,忙
//       2,失败
USBD_StatusTypeDef USBD_LL_OpenEP(USBD_HandleTypeDef *pdev, uint8_t ep_addr, uint8_t ep_type, uint16_t ep_mps)
{
		HAL_StatusTypeDef hal_status = HAL_OK;
		USBD_StatusTypeDef usb_status = USBD_OK;

		hal_status = HAL_PCD_EP_Open(pdev->pData, ep_addr, ep_mps, ep_type);

		usb_status =  USBD_Get_USB_Status(hal_status);
	 
		return usb_status;
}

//USBD取消初始化(关闭)某个端点
//pdev:USBD句柄指针
//ep_addr:端点号 
//返回值:0,正常
//       1,忙
//       2,失败
USBD_StatusTypeDef USBD_LL_CloseEP(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{
		HAL_StatusTypeDef hal_status = HAL_OK;
		USBD_StatusTypeDef usb_status = USBD_OK;
		
		hal_status = HAL_PCD_EP_Close(pdev->pData, ep_addr);
				
		usb_status =  USBD_Get_USB_Status(hal_status);

		return usb_status;  
}

//USBD清空某个端点的数据
//pdev:USBD句柄指针
//ep_addr:端点号 
//返回值:0,正常
//       1,忙
//       2,失败
USBD_StatusTypeDef USBD_LL_FlushEP(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{
		HAL_StatusTypeDef hal_status = HAL_OK;
		USBD_StatusTypeDef usb_status = USBD_OK;
		
		hal_status = HAL_PCD_EP_Flush(pdev->pData, ep_addr);
				
		usb_status =  USBD_Get_USB_Status(hal_status);
		
		return usb_status;  
}

//USBD给某个端点设置一个暂停状态
//pdev:USBD句柄指针
//ep_addr:端点号 
//返回值:0,正常
//       1,忙
//       2,失败
USBD_StatusTypeDef USBD_LL_StallEP(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{
		HAL_StatusTypeDef hal_status = HAL_OK;
		USBD_StatusTypeDef usb_status = USBD_OK;
		
		hal_status = HAL_PCD_EP_SetStall(pdev->pData, ep_addr);

		usb_status =  USBD_Get_USB_Status(hal_status);
	 
		return usb_status;  
}

//USBD取消某个端点的暂停状态
//pdev:USBD句柄指针
//ep_addr:端点号 
//返回值:0,正常
//       1,忙
//       2,失败
USBD_StatusTypeDef USBD_LL_ClearStallEP(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{
		HAL_StatusTypeDef hal_status = HAL_OK;
		USBD_StatusTypeDef usb_status = USBD_OK;
		
		hal_status = HAL_PCD_EP_ClrStall(pdev->pData, ep_addr);  
			 
		usb_status =  USBD_Get_USB_Status(hal_status);

		return usb_status; 
}

//USBD返回是否处于暂停状态
//pdev:USBD句柄指针
//ep_addr:端点号 
//返回值:0,非暂停; 1,暂停.
uint8_t USBD_LL_IsStallEP(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{
		PCD_HandleTypeDef *hpcd = (PCD_HandleTypeDef*) pdev->pData;
		
		if((ep_addr & 0x80) == 0x80)
		{
			return hpcd->IN_ep[ep_addr & 0x7F].is_stall; 
		}
		else
		{
			return hpcd->OUT_ep[ep_addr & 0x7F].is_stall; 
		}
}

//USBD为设备指定新的USB地址
//pdev:USBD句柄指针
//dev_addr:新的设备地址,USB1_OTG_HS/USB2_OTG_HS
//返回值:0,正常
//       1,忙
//       2,失败
USBD_StatusTypeDef USBD_LL_SetUSBAddress(USBD_HandleTypeDef *pdev, uint8_t dev_addr)
{
		HAL_StatusTypeDef hal_status = HAL_OK;
		USBD_StatusTypeDef usb_status = USBD_OK;
		
		hal_status = HAL_PCD_SetAddress(pdev->pData, dev_addr);
			 
		usb_status =  USBD_Get_USB_Status(hal_status);
	 
		return usb_status;  
}

//USBD通过端点发送数据
//pdev:USBD句柄指针
//ep_addr:端点号 
//pbuf:数据缓冲区首地址
//size:要发送的数据大小
//返回值:0,正常
//       1,忙
//       2,失败
USBD_StatusTypeDef USBD_LL_Transmit(USBD_HandleTypeDef *pdev, uint8_t ep_addr, uint8_t *pbuf, uint16_t size)
{
		HAL_StatusTypeDef hal_status = HAL_OK;
		USBD_StatusTypeDef usb_status = USBD_OK;

		hal_status = HAL_PCD_EP_Transmit(pdev->pData, ep_addr, pbuf, size);
			 
		usb_status =  USBD_Get_USB_Status(hal_status);
		
		return usb_status;    
}

//USBD准备一个端点接收数据
//pdev:USBD句柄指针
//ep_addr:端点号 
//pbuf:数据缓冲区首地址
//size:要接收的数据大小
//返回值:0,正常
//       1,忙
//       2,失败
USBD_StatusTypeDef USBD_LL_PrepareReceive(USBD_HandleTypeDef *pdev, uint8_t ep_addr, uint8_t *pbuf, uint16_t size)
{
		HAL_StatusTypeDef hal_status = HAL_OK;
		USBD_StatusTypeDef usb_status = USBD_OK;

		hal_status = HAL_PCD_EP_Receive(pdev->pData, ep_addr, pbuf, size);
			 
		usb_status =  USBD_Get_USB_Status(hal_status);
			
		return usb_status; 
}

//USBD获取最后一个传输包的大小
//pdev:USBD句柄指针
//ep_addr:端点号  
//返回值:包大小
uint32_t USBD_LL_GetRxDataSize(USBD_HandleTypeDef *pdev, uint8_t ep_addr)
{
		return HAL_PCD_EP_GetRxCount((PCD_HandleTypeDef*) pdev->pData, ep_addr);
}

//USBD 延时函数(以ms为单位)
//Delay:延时的ms数.
void USBD_LL_Delay(uint32_t Delay)
{
		delay_ms(Delay);
}

/**
  * @brief  Static single allocation.
  * @param  size: Size of allocated memory
  * @retval None
  */
void *USBD_static_malloc(uint32_t size)
{
  static uint32_t mem[(sizeof(USBD_CDC_HandleTypeDef)/4)+1];/* On 32-bit boundary */
  return mem;
}

/**
  * @brief  Dummy memory free
  * @param  p: Pointer to allocated  memory address
  * @retval None
  */
void USBD_static_free(void *p)
{

}

/**
  * @brief Software Device Connection
  * @param hpcd: PCD handle
  * @param state: Connection state (0: disconnected / 1: connected)
  * @retval None
  */

#if (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
static void PCDEx_SetConnectionState(PCD_HandleTypeDef *hpcd, uint8_t state)
#else
void HAL_PCDEx_SetConnectionState(PCD_HandleTypeDef *hpcd, uint8_t state)
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
{
  /* USER CODE BEGIN 6 */
  if (state == 1)
  {
    /* Configure Low connection state. */

  }
  else
  {
    /* Configure High connection state. */

  }
  /* USER CODE END 6 */
}

/**
  * @brief  Retuns the USB status depending on the HAL status:
  * @param  hal_status: HAL status
  * @retval USB status
  */
USBD_StatusTypeDef USBD_Get_USB_Status(HAL_StatusTypeDef hal_status)
{
		USBD_StatusTypeDef usb_status = USBD_OK;

		switch (hal_status)
		{
			case HAL_OK :
				usb_status = USBD_OK;
			break;
			case HAL_ERROR :
				usb_status = USBD_FAIL;
			break;
			case HAL_BUSY :
				usb_status = USBD_BUSY;
			break;
			case HAL_TIMEOUT :
				usb_status = USBD_FAIL;
			break;
			default :
				usb_status = USBD_FAIL;
			break;
		}
		return usb_status;
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
